{
  "text": "RFP No. 25-0037 \nPage 1 of 7 \n \nSAINT REGIS MOHAWK TRIBE  \n71 Margaret Terrance Memorial Way  \nAkwesasne, New York  \n \nREQUEST FOR PROPOSAL (RFP)  \n \nNO. 25- 0037  \n \nWEBSITE DEVELOPMENT & MAINTENANCE  \nAKWESASNE, NEW YORK  \n \nRFP due date and time: Wednesday , March 12 , 2025 no later than 3:30 pm ( Local Time ) \n \n1. INTRODUCTION.  The Saint Regis Mohawk Tribe (SRMT) is seeking proposals from qualified and experienced  \nindividuals/ companies (“Proposer[s]”) to update and centralize department and program websites for the SRMT, all in \naccordance with the S cope  of Work  and Request for Proposal Documents attached to this RFP . \n \n2. ABOUT SRMT .  The SRMT is a federally -recognized  government of the Saint Regis Mohawk R eservation at \nAkwesasne, New York.  The territory under our jurisdiction lies south of the border dividing the US and Canada.  The lands north of the border are under the juris diction of our counterparts, the Mohawk Council of Akwesasne.  \n The Saint Regis M ohawk Tribe administers numerous programs and services for community members, the details of \nwhich you will find throughout our current website, https://www.srmt -nsn.gov/about\n .  The Tribe’s governing body the \nSaint Regis Mohawk Tribal Council, is made up of three chiefs, three sub -chiefs, all responsible for setting policy and \nmaking major decisions on behalf of the Tribe.  They oversee the operation of the Saint Regis Mohawk Tribal \ngovernment and assure that quality programs and services are made available to the Mohawk People.   \n \nThe Saint Regis Mohawk Tribe today administers its own environment, social, policing, economic, health and educational programs, policies, laws and regulations.  \n \n3. PROJECT GOALS AND OBJECTIVES .  SRMT’s current website was launched in Fall, 2024 and since then has \nnot been  upgraded.   The primary  goal of this project is to centralize and update a user -friendly , visually appealing and \nmobile -responsive website that continues to effectively communicate our overall mission, identify program services \nand enhances user experience while supporting our strategic objectives.  Also, a requireme nt will be to provide traini ng \nfor Tribal program staff to maintain websites without the need for specialized technical knowledge or assistance.  \n \n4. SCOPE OF WORK .  The Scope for this project may include, but is not limited to, tasks set forth below.  Proposals \nshould describe how each of the project deliverables will be provided.  \n Tasks and Deliverables : \n• Bring all Tribal department and program websites under one host;  \n• Provide Hosting and Cloud Infrastructure Services;  \n• Ensure gated legacy website content preservation;  \n• Integrate new features as requested by the SRMT;  \n• Update and maintain website security;  \n• Address specific website technical issues such as user interface errors, deployment bugs, etc.  \n• Provide alternative solutions along with comparisons and estimates on the required level  of effort to solve SRMT \nneeds;  \n• Liaise with the SRMT Communications Team on website development and maintenance, as needed;  \n• Liaise with Division Directors and Program Managers for input and develop, build, update and maintain websites \nbased on Directors an d Managers website needs;  \nRFP No. 25-0037 \nPage 2 of 7 • Apply knowledge and demonstrated use of current Craft Content Management System (CMS; Tribe currently \nuses Craft CMS 3) to address the Tribe’s needs for a usable, flexible, secure content management system to \npublish its content w ithout the need for additional specialized development support;  \n• Ensu re seamless user experience and user -friendly interface along with tools that enable complete control of \ncontent without the need for specialized technical knowledge or assistance;  \n• Provid e written reports of completed deliverables on a regular basis to SRMT;  \n• Provide documentation of new web- based, digital features, and modules – both technical and instructional;  \n• Respond to inquiries and follow -up to action items in a timely manner;  \n• Be available with reasonable notice to meet the SRMT representatives; and  \n• Provide training to Tribal staff on how to maintain and add content to the website.  \n• Provide a fully transparent and detailed post -launch website maintenance and improvement plan.  \n \n5. TERM .   The term of the Contract will commence upon receipt of a fully executed contract  and all Services will \nterminate 1 -year from execution of a Contract for this Project .  Contracts may be extended upon mutual consent and \nwritten amendment signed by both parties.  \n \n6. PAYMENT .  The SRMT will compensate the successful proposer monthly, in arrears, upon satisfactory completion of  \nservice provided pursuant to proposer’s Fee Proposal  and approved by the SRMT Representative . \n \nTax Exemption.  The SRMT is a tax-exempt  organization.  Exemption Organization Certification # EX 152433 certifies \nthat the property and/or services ordered/purchased hereby are for the use of, and are being purchased by the SRMT, \nand are , therefore, not subject to New York State sales and use taxes.  \n  \n7. INSURANCE .  Successful Proposer will provide and maintain insurance coverage for the duration of the contract period \nand will provide , upon request, a copy of the following certificates of insurance coverage:  \na. Comprehensive General Liabili ty coverage, minimum $1,000,000.00 (US) general aggregate and the same amount \nfor each occurrence submit, if any, and naming the Saint Regis Mohawk Tribe as additional insured ; and  \nb. Business Automobile Liability  coverage, minimum $1,000,000.00 (US) combined single limit or $1,000,000.00 \nbodily injury and $500,000.00 property damage, when contractor uses any vehicle, owned or non- owned in \nperforming contractual duties . \nAll insurances are to be underwritten by a company satisfactory to the SRMT (Best “A” ratin g) and authorized to do \nbusiness in the state of New York.  \nAny insurance acquired or maintained by the Contractor is at your own expense and for its own benefit and protection. \nIt does not release the Contractor from or reduce its liability under this agre ement.  \n \n8. PROPOSAL INSTRUCTIONS . \na) Submission and Delivery.   Proposals are to be submitted in a sealed envelope and addressed to : \nSaint Regis Mohawk Tribe, Grants & Contracts Office, 71 Margaret Terrance Memorial Way , Akwesasne, NY 13655  \nor via E -mail to: grants.contracts@srmt -nsn.gov .  Please label on the envelope or on the subject line “RFP No. 25-\n0037 Website Development and Maintenance , Akwesasne, New York”  \nNO PROPOSAL WILL BE ACCEPTED IF SUBMUITTED ORAL LY OR VIA TELEPHONE  \nb) Due Date and Time.   Proposals for this RFP must be received on or by 3:30 p.m. (local time) , Wednesday , March \n12, 2025 to be considered.  Proposals received after the closing time will not be considered.  Proposers should allow \nsufficient mail delivery time to ensure receipt by the closing date and time.  \nc) Inquiries.   All questions, comments, and any other communications relative to this RFP are to be submitted, in \nwriting, no later than five ( 5) calendar  days prior to the closing due date and time, to: Saint Regis Mohawk Tribe, \nGrants & Contracts Office, 71 Margaret Terrance Memorial Way, Akwesasne, NY 13655 or via E -mail to: \ngrants.contracts@srmt -nsn.gov .  All responses to the inquiries will be distributed to all proposers in the form of an \nRFP No. 25-0037 \nPage 3 of 7 Addendum.  Inquiries or communications are to be directed ONLY to the Grants & Contracts O ffice throughout \nthis solicitation period.   Non -compliance with this condition may result in disqualification of your proposal.  \nd) It is the responsibility of the proposer to obtain clarification of the requirements contained herein, if  necessary, prior \nto submitting a proposal.  \ne) All proposals must be in the format required in this RF P.  Failure to comply may be reason to declare the proposals \nnon-responsive.  \nf) Amendment to Proposal  – Proposals may be amended in writing and delivered to the closing location before  the \nclosing time , but not after.  Such amendments should be signed by the authorized signatory of the Proposer  and \neither hand delivered, e -mailed, or mailed to the Grants & Contracts Office.  \ng) Acceptance of Terms and Conditions – Submission of a proposal will  constitute acknowledgement and \nacceptance of all the terms and conditio ns contained in this RFP, unless otherwise specified in the proposal.  \nh) Withdrawing  Proposals  – Proposals may be withdrawn prior to the time set for opening Proposals. Request for \nnon-consideration of proposals must be made in writing to the Grants & Contrac ts Office.  \ni) Proposal Validity Period  – The Proposal is valid for 60 calendar days following the closing date and time shown \nherein.  \n  \n9. PROPOSAL FORMAT & EVALUATION CRITERIA.  For a proposal to be considered responsive, the proposal \nshall respond to all requirements of this part of the RFP.  Evaluation of proposals will be assessed on the information \nprovided below.  Proposals must be answered in the same order in which it is requested here:  \na) Transmittal Letter  \nThe letter of transmittal should include:  \ni. an introduction of the proposer/proposing firm to include name and contact information (email, phone, \nmailing address, etc.) and, if applicable, the representative authorized to make representations for \nProponent, title(s) and contact information.  \nii. a general statement of interest and what sets proposer apart from other potential respondents.  \niii. a general statement of any preferences applicable to you/your firm as identified at subparagraph (e) below.  \niv. signature by the individual who is authorized to contractually bind proponent.  An unsigned transmittal \nletter may cause the proposal to be rejected.  \nb) Executive Summary  \nThe executive summary should briefly describe  the following:  \ni. proposer’s approach to Web Development and Maintenance Services and its summarized approach to \ncompleting the scope of services outlined .   \nii. summary of any potential problems you may encounter in the performance of this project and provide \ncreative suggestions for addressing these problems.  \niii. identify any options or alt ernatives being proposed and clearly disclose any major requirements included in \nthe scope of services proponent cannot address.  \niv. your expectations of the SRMT and its representatives and staff that may be involved in the services required.  \nv. a propose d schedule of deliverables to include length of time needed for each task.  \nc) Experience and Qualifications  \nThis section must contain a minimum of the following information:  \ni. a brief summary of you/ your firm ’s experience in this field  and overall qualifica tions.  \nRFP No. 25-0037 \nPage 4 of 7 ii. provide a list of key personnel that will be assigned to this project  and the role that each will play.  \niii. for all Key Personnel assigned to this project, biographies should be included in this section.  \niv. provide three (3) samples of work pe rformed  similar in size and scope to the work being requested by SRMT.  \nSamples could be in the form of a website lin k or simila r. \nv. provide  a minimum of three (3) business references of existing clients which should include all contact \ninformation.  \nd) Fee Proposal   \ni. SRMT is interested in a firmed fixed pricing structure to include all aspects of the project, but not necessarily \nlimited to:  1) labor costs; 2) Hosting and Maintenance Costs; 3) License Renewals.  All respondents must \ninclude a fee for services proposal  showing their projected costs for each of these aspects.  All invoices are \nsubject to a Net 30 term.  \nii. Fee proposals should identify any costs SRMT can expect to be charged and specify the types of services that \nwould generate any addit ional charges.  \niii. Respondents are free to submit alternative fee proposals for consideration.  \ne) Preferences.   Only one (1) preference will be applied to qualified proposers.                                      \ni. Native / Mohawk Preference \nIf eligible for N ative American Preference, provide proof of enrollment/membership (such as a tribal \nenrollment card) in a federally recognized Tribe or proof of certification as an Indian- owned business (Native \nAmerican Ownership must be 51% or more).  Individuals or busi nesses that are registered/certified with the \nSRMT as Mohawk Owned Businesses, will be granted extra points in the evaluation for goods and services.  (See Attachment “A”, Native American Preference Policy)  \n(or) \nii. Women Business Enterprise and Disabled Veter an Business Enterprise  \nIf eligible for WBE/DVBE preference, provide proof of certification, which may consist of business registered to the WBE/DVBE owner and a copy of your certification from a government agency in the state the contractor is incorporate d or has its principal business.  \n(or) \niii. Minority Business Enterprise and Veteran Business Enterprise  \nIf eligible for MBE/VBE preference, provide proof of certification, which may consist of business \nregistered to the MBE/VBE owner and a copy of your certific ation from a government agency in the state \nthe contractor is incorporated or has its principal business.  \n \n10. EVALUATION CRITERIA \nEvaluation of submitted proposals will be based on the criteria below with m aximum allowed points being 102.  \nRespondents may be requested to meet with an Evaluation Team for oral presentations at the discretion of the Evaluation \nTeam.  Proposals, however, may be accepted without oral presentation.   \n \na) Strategy, Approach and Methodolog y (Comprehension)      30 Points  \nb) Fee Proposal  and Schedule             25 Points  \nc) Firm Experience & Qualifications/Personnel Qualifications      35 Points  \ne) Preferences ( Only 1, if applicable ) \n  i.   Native Preference              10 Points  \n  ii. Mohawk Preference                     Additional   2 Points   \n  iii. WBE & Veteran with Disabilities Business Enterprise          5 Points  \n  iv. MBE and Veterans Business Enterprises             3 Points  \n \n \nRFP No. 25-0037 \nPage 5 of 7 11.CE\nRTIFICATIONS .  Proposer agrees to comply with and return all signed certifications with proposals, as follows:\na)S\nRMT Combined Certifications  for Lobbying; Certification Regarding Debarment; Certification Regarding Drug-\nFree Workplace; Certification Regarding Trafficking in Persons and Anti -Collusion Statement  (See Attachment\n“B”);\nb)S\nRMT Respiratory Virus Workplace Safety Standards, V011 dated March 13, 2024 (or as amended) ( See\nA\nttachment “C ”).\n12.ADDE\nNDA.   To ensure consistency and quality of information provided to respondents the Grants & Contracts Office\nwill provide, simultaneously to all individuals/firms to which this solicitation has been sent, any information with\nrespect to significant inquiries received and the replies to such inquiries without revealing the sources of the inquiries.\nAddenda to this RFP may be issued at any time prior to the time set for receipt of proposals.   Failure of any Proposer to\nreview any such addendum shall not relieve the Proposer from any obligations under their Proposal submitted. All\naddenda so issued shall become part of the Contract Documents.\n13.E\nVALUATION PROCESS.\na)Evaluation of Proposal .  The purpose of the proposal evaluation process is twofold: (1) to assess the responses for\ncompliance with the RFP’s minimum qualifications, content, format requirements; and (2) to identify the Proposersthat have the highest probability of satisfactorily performing the services requested by the Saint Regis MohawkTribe.  The evaluat ion process will be conducted in a comprehensive and impartial manner.\nb)Evaluation Team.  Proposals will undergo an evaluation process conducted by an Evaluation Team  comprised of\n3 Team Members.  The Evaluation Team, in its exclusive discretion, shall sel ect such proposals that are considered\nto be in the best interest of the SRMT.\nc)Interviews.   If necessary,  interviews may be scheduled with  selected Proposers as soon as possible after th\ne\npr\noposal opening, to permit further evaluation and to allow the S RMT to inquire further into the Proposer ’s\ne\nxperience on similar projects, willingness to work closely with SRMT Staff, thorough understanding of the various\naspects of the project, ability to maintain a tight schedule and complete the project on time, wit hin budget and other\npertinent matters .\nd)No\nn-Responsive  Proposals .  Non -responsive proposals may be rejected by SRMT, and will not be distributed to\nthe Evaluation T eam for consideration.  Additionally, the evaluation team may determine that required\nsubmittals/documentation is so inadequate as to be determined non- responsive.  Non- responsive proposals ma y\ni\nnclude, but are not limited to the following:\n•Failure to sign the proposal\n•Failure to acknowledge addenda (if issued)\n•Failure to provide required s ubmittals/documentation\n•Submission of a late proposal\n•Proposer does not meet the minimum requirements\ne)C\nost to Prepare.  No payment shall be made for costs incurred in the preparation and submission of your proposal in response\nto this RFP.\nf)A\ncceptance/Rejection.   The SRMT reserves the right to cancel this RFP, to reject any or all proposals received, or\nany part thereof without penalty, to waive informalities or irregularities and to award a contract based not solely onthe lowest cost, but based on an offer which, in the opinion of the SRMT, best meets the requirements of this RFPand is deemed to be in the best interest of the SRMT. Non -acceptance of a proposal means that another proposal\nwas deemed more advantageous to the SRMT or that all proposals were rejected.\ng)Return of Proposal.  The SRMT advises th at all proposals submitted under this RFP shall become the property of\nthe SRMT and will not be returned.  However, if any portion of the proposal is marked “proprietary” and ishighlighted, this portion can be returned after award of contract, if requested.\nRFP No. 25-0037 \nPage 6 of 7  \n14. AWARD.  The contract, if awarded, will be awarded to the firm whose proposal is deemed most advantageous to the \nSRMT, as determined in accordance with the Evaluation Criteria.  SRMT reserves the right to solicit additional \ninformation from the Proposer should the SRMT deem such information necessary.  The lowest or any proposal will \nnot necessarily be accepted.  The SRMT reserves the right to award one or more contracts.  \n \n15. POST AWARD.  SRMT will advise unsuccessful Proposers within one week after SRMT has entered into a contractual \narrangement with the successful Proposer.  \n \n16. CONFIDENTIAL  INFORMATION.  All proposals are treated as confidential.  If a proposer believes portions of \ntheir re sponse are exempt from disclosure, the respondent shall clearly mark this information “Confidential”.  \n \n17. PROTEST.   \na. Form of Protest.  A Proposer who is qualified to protest shall submit the written protest to the SRMT Grants & Contracts Office, 71 Margaret T errance Memorial Way, Akwesasne, NY 13655, who will forward the matter to \nAdministration.  \ni) The protest  must be in writing  and sent by certified  or registered  mail or delivered  personally  to Grants & \nContracts Office.  If the protest  is hand- delivered,  a receipt  must be requested.  \nii) The protest  shall  include  the name, address,  telephone  and e-mail of the party protesting  or their \nrepresentative.  \niii) The title of the RFP and a  detailed  description  of the specific legal  and factual  grounds  of protest  and any \nsupporting  docum entation  shall  be included. \niv) The specific ruling or relief  requested  must be stated.  \nv) The SRMT , at its discretion,  may make a decis ion regarding  the protest  without  requesting  further \ninfor mation  or docum ents from  the protestor. There fore, the initial protest  submittal must include  \nall \ngrounds  for the protest  and all evidence  available  at the time the protest  is subm itted.  If the protestor  later \nraises new grounds  or evidence  that was not included in the initial protest  but which  could  have  been raised  \nat that time, the SRMT  will not consider  such new grounds  or new evidence.  \nb. After Award.   A Proposer submitting a proposal may protest the award based on allegations of improprieties \noccurring during the proposal evaluation or award period if it  meets all of the following conditions:  \ni) The Proposer  has submitted a proposal  that it belie ves to be responsive  to the solicitation  docum ent; \nii) The Proposer  believes that its proposal  meets the administrative  and technical  require ments of the  \nsolicitation,  proposes  items and/or  services of proven  quality  and perfor mance,  and offers  a competitive  \ncost;  and \niii) The Proposer  believes and has reasonable justification  that the SRMT  has incorrectly  selected  another \nProposer  submitting  a proposal  for an award.  \nSuch  protests  must be received  by the  SRMT  no later than five (5) business  days after Proposer’s receipt of \nunsuccessful proposer notification.  \n \nc. Appeals Process.   The decision of SRMT will be considered the final decision.  \n \n18. SRMT CORPORATE COMPLIANCE.  When submitting a proposal/bid you understand and agree you must comply with the SRMT Corporate Compliance Policy.  As recipients of Department of Health and Human Services \nand other federal and state funding, all successful proposers/bidders will be screened against the Department of Health \n& Human Services/Office of Inspector General and The System for Award Management (SAM) exclusion database, \nprior to contracting with the SRMT and for the duration of the contract.  \n \nProposers/bidders further understand t hat, to ensure fairness, openness and transparency in the solicitation process, the \ncommission of certain acts or offences will render them ineligible to be awarded a contract/agreement. SRMT will \ndeclare non -responsive any proposal/bid in respect of which the information herein requested is missing or inaccurate, \nor in respect of which the information contained in the certifications specified hereinafter is found to be untrue, in any \nrespect, by SRMT. If it is determined, after contract/agreement award, th at the Proposer/bidder made a false \nRFP No. 25-0037 \nPage 7 of 7 declaration, SRMT will have the right to terminate the Contract/Agreement for default. The Proposer/bidder will be \nrequired to diligently maintain up- to-date the information herein requested. The Proposer/bidder and any of the \nProposer/bidder’s affiliates, will also be required to remain free and clear of any acts or convictions specified herein \nduring the period of any contract arising from this proposal solicitation.  \n \nProposers/bidders who are incorporated, including those submitting as a joint venture, must provide with their \nproposal/bid or promptly thereafter a complete list of names of all individuals who are currently directors of the \ncompany/firm. Proposers/bidders submitting as sole proprietorship, including those  submitting as a joint venture, must \nprovide with their proposal or promptly thereafter the name of the owner. Proposers/bidders submitting as societies, \nfirms, or partnerships do not need to provide lists of names. If the required names have not been rece ived by the time \nthe evaluation of proposals is completed, SRMT will inform the Proposer/Bidder of a time frame within which to \nprovide the information. Failure to comply will render the proposal/bid non- responsive. Providing the required names \nis a mandat ory requirement for contract award.  \n \n19. TERMS AND CONDITIONS.   The terms and conditions applicable to this Request for Proposals are the Saint Regis \nMohawk Tribe (SRMT) General Contract Terms and Conditions for Service  (See Attachment “D”).  \nRFP 25-0037 Attachment \"A\"\n\n Native American Preference Policy  \n Version 003  Page 1 of 12 \n Table of C ontents  \nI. PURPOSE  ................................ ................................ ................................ ................................ ........  2 \nII. POLICY STATEMENT  ................................ ................................ ................................ .................  2 \nIII. DEFINITIO NS ................................ ................................ ................................ ................................ . 2 \nSECTION 1 ................................ ................................ ................................ ................................ ..................  4 \nGOODS & SERVICES  ................................ ................................ ................................ ...............................  4 \nNATIVE AMERICAN PREFERENCE STANDARDS  ................................ ................................ ..........  4 \nI. GOODS AND SERVICES PREFERENCE STANDARDS (excluding construction)  .........  4 \nII. GOODS AND SERVICE SLIDING SCALE (excluding construction)  ................................ . 4 \nSECTION 2 ................................ ................................ ................................ ................................ ..................  6 \nCONSTRUCTION  ................................ ................................ ................................ ................................ ...... 6 \nNATIVE AMERICAN PREFERENCE STANDARDS  ................................ ................................ ..........  6 \nI. CONSTRUCTION – NATIVE AMERICAN PREFERENCE STANDARDS  .....................  6 \nII. CONSTRUCTION – SLIDING SCALE  ................................ ................................ ..................  6 \nSECTION 3 ................................ ................................ ................................ ................................ ..................  8 \nConstruction Native American Preference Plan Requirements  ................................ .............................  8 \nI. Construction – Native American Preference Employment Plan Requirement  ....................  8 \nSECTION 4 ................................ ................................ ................................ ................................ ..................  9 \nI. MANDATORY COMPLIANCE ................................ ................................ ................................ .... 9 \nII. COMPLIANCE ENFORCEMENT  ................................ ................................ ...............................  9 \nAppendix  A ................................ ................................ ................................ ................................ ................  10 \nAppendix B  ................................ ................................ ................................ ................................ ................  11 \n \n \n \n \n \n \n \n \n \n \n Native American Preference Policy  \n Version 003  Page 2 of 12 \n  \n \n \n \n \n \nI. PURPOSE  \nThe purpose of this policy is to promote the self -sufficiency and economic growth of the \nSaint Regis Mohawk Tribe  (“Tribe  or SRMT ”) and its members, by promoting the \ndevelopment of Native  American and Mohawk owned businesses; and to provide \npreference in the Tribal hiring process.  \nII. POLICY STATEMENT  \nThe Tribe reserves  its unique legal right to give Native Americans and Mohawks  special \nconsideration for employment, training, contracting, subcontracting, and business \nopportunities that exist on, and in some cases, near the Saint Regis Mohawk  Reservation .   \nIII. DEFINITIONS  \nA. Director  or Tribal Representative (which is identified in each contract)  –the \nindividual or department, appointed by Tribal Council to ensure compliance with \nthis policy . \nB. Mohawk  – enrolled /eligible to be enrolled  in the Saint Regis Mohawk Tribe ; this \nwould  include a  member of the  Mohawk Council of Akwesasne Band and/or the \nMohawk Nation.  \nC. Mohawk Business  – a business mainly owned by a Mohawk;  control s the majority \nof the business  (at least 51% or more) ; and be substantially involved in the day -to-\nday managem ent and operations of the business  and has been registered and \nreceived the SRMT Native American Preference Certification through the SRMT \nCompliance Department.  \nD. Native American  – an enrolled member of a federally recognized tribe, band, \nnation, including Alaska Native.  \nE. Native American Owned Business  (NAO B) - a company that is at least 51% \nowned and operated (e.g. management decisions) by a Native American  and has \nbeen registered and received a SRMT  Native American Preference  Certification  \nthrough the SRMT Compliance Department . \nF. Native American Preference  - the process for providing  additional points  or \npercentages  to Native American  individuals or business entities in the evaluation  \nprocess for contracts or bidding for goods  and for hiring.  \n \nSAINT REGIS MOHAWK TRIBE  \nNATIVE AMERICAN PREFERENCE \nPOLICY   \nAMEND ED IN  2021 VERSION 003  \n \n Native American Preference Policy  \n Version 003  Page 3 of 12 \n G. “Native American Preference  Employment  Plan” an employment plan , which \nConstruction Contractors and sub -contractors must submit for proposals and \nadhere to when contracting with the Tribe.  \nH. “Qualified business or company ” shall mean a Business or Company meeting the \nminimum requirements for a contract. A Qualified Business or Company shall \nhave proper insurance coverage, including liability, workers’  compensation and \nother essential coverage and meet al l other requirements contained in the \nInvitation for Bids /Request for Quotes . A Qualified business  or company  also \nmeets the practical, technical, administrative and financial requirements of a firm \nto perform or, if permitted , through subcontracts, the services or goods \nspeci fically set out in the bid or request for proposal package.  \nI. \"Reservation \" means both the Saint Regis Mohawk Indian Tribe Reservation as \nestablished by the 1796 Treaty with the Seven Nations of Canada (7 Sta t. 55) and \nany other lands over which the Tribe exercises jurisdiction now or in the future .  \nJ. \"Responsible bidder \" is defined as a contractor, supplier, or vendor, qualified on \nthe basis that it (1) has adequate financial resources to perform a contract, (2) is \nable to comply with the associated legal or regulatory requirements, (3) is able to \ndeliver according to th e contract schedule, (4) has a history of satisfactory \nperformance, (5) has good reputation, (6) has or can obtain necessary data, \nequipment, and facilities, and (7) is otherwise eligible and qualified to receive the \naward if its bid is chosen.  \nK. “SRMT Nativ e American Preference  Certification ” is the certification provided \nby the SRMT Compliance Department  where the Native Vendor meets the Native \nAmerican Owned Business or Company or Mohawk Business definition of this \npolicy  as per Exhibit A .  \nL. “Unskilled Worker ” for the purpose of this policy is an individual worker that \nrequires practically no training or experience for its adequate performance.  \n \nIV. SCOPE  \nThis policy shall apply to the Saint Regis Mohawk Tribe and any Tribal entity, \nsubsidiary, or enterprise , including , but not limited to,  the Akwesasne Housing Authority  \nand Mohawk Gaming Enterprises, LLC  for the procurement of goods, services, and \nconstruction contracts .  \nThis policy shall also apply to the above entities during the selection/hiring process . \nWherever the Tribe is mentioned in this policy, the procedures outlined herein also apply \nto any Tribal entity, subsidiary, enterprise, or wholly -owned corporation.   \n \n \n \n \n \n Native American Preference Policy  \n Version 003  Page 4 of 12 \n SECTION 1 \nGOODS & SERVICES   \nNATIVE AMERICAN PREFERENCE STANDARDS  \n \nI. GOODS AND SERVICES PREFERENCE STANDARDS (excluding construction ) \n \nA. Application .  Native American Preference  shall be applied to all acquisitions for \ngoods and services for the Saint Regis Mohawk Tribe.  Specifically,  for the \nacquisition of goods and services where price is the determining factor, the preference \nshall be applied in accordance wi th the SRMT Native American Preference  Policy \nSliding Scale for Procurement of Goods and Services  in Section IX of this policy . \nB. Individuals or Businesses that are registered/certified as Mohawk Owned Businesses \nwill be granted an extra 2% or 2 points in the evaluation for good s and  services . \nC. In any circumstance, the Native American Preference  must be applied after all \nbidders or proposers are deemed qualified.   \nD. Solicitation of Quotes:  The Tribe shall solicit construction contracts in accordance \nwith the Tribe’s Procurement Policy.  \n \nTribal entities, subsidiaries, and enterprises, including, b ut not limited to, the \nAkwesasne Housing Authority and Mohawk Gaming Enterprises, LLC shall adhere \nto their respective procurement of goods, services, and construction contract policies \nwhile incorporating the Native Preference Policy.  \nII. GOODS AND SERVICE SL IDING SCALE (excluding construction)    \nThe sliding scale chart below shall be applied as necessary to the procurement of goods \nand services , excluding construction contracts . \n   Native American Preference Policy Sliding Scale Percentages for Procurement of  Goods and Services  \n           \n  Minimum  Maximum   NAP %  Max Lowest \nBid NAP  \nPreference $  NAP  \nExtra \nCost  Mohawk \nPreference  \nAdding 2%   \nMohawk \nPreference $   \nMP extra \nCosts  \nBetween  $3,000  $10,000  13.0%  $10,000  $11,300  $1,300  15%  $11,500  $1,500  \nBetween  $10,001  $25,000  12.0%  $25,000  $28,000  $3,000  14%  $28,500  $3,500  \nBetween  $25,001  $50,000  11.0%  $50,000  $55,500  $5,500  13%  $56,500  $6,500  \nBetween  $50,001  $100,000  10.0%  $100,000  $110,000  $10,000  12%  $112,000  $12,000  \nBetween  $100,001  $200,000  10.0%  $200,000  $220,000  $20,000  12%  $224,000  $24,000  \nBetween  $200,001  $500,000  10.0%  $500,000  $550,000  $50,000  12%  $560,000  $60,000  \nBetween  $500,001  $750,000  7.0%  $750,000  $802,500  $52,500  9% $817,500  $67,500  \nBetween  $750,001  $1,000,000  5.0%  $1,000,000  $1,050,000  $50,000  7% $1,070,000  $70,000  \nBetween  $1,000,001  $2,000,000  2.5%  $2,000,000  $2,050,000  $50,000  4.5%  $2,090,000  $90,000  \n    $ 2,000,001+  1.0%  $2,000,001  $2,020,001  $20,000  3% $2,060,001  $60,001  \n \n \n \n Native American Preference Policy  \n Version 003  Page 5 of 12 \n Example #1:  \n  Minimum  Maximum  % Lowest Bid   % Applied  Preference $  Extra Cost  \nBetween  $3,000  $10,000  13.0%  $6,000   13%  $6,780  $780  \n Native Preference:  The lowest bid was a non -native with $6,000  \nthe native bidder must meet the 13% native preference .  \nMeaning, the native  bidder ’s bid must meet or be lower than $6,780  to be eligible for the award.  \nEXAMPLE #2:  \n  \n  Minimum  Maximum  % Lowest Bid   % Applied  Preference $  Extra Cost  \nBetween  $25,001  $50,000  11.0%  $48,000   11.00%  $53,280  $5,280  \nNative Preference:  The lowest bid was a non -native with $48,000 ; \nthe native bidder must meet the 11% native preference .  \nMeaning, the native bidder ’s bid must meet or be lower than  $53,280  to be eligible for the award.   \n \nEXAMPLE #3 ; Mohawk Preference Example:     \n  Minimum  Maximum  % Lowest Bid  % Applied  Mohawk \nPreference  Preference $  Extra Cost  \nBetween  $25,001  $50,000  11.0%  $48,000  11.0%  2% $54,240  $6,240  \n \nMohawk Preference:  The lowest bid was a non -native with $48,000 . The Mohawk bidder must \nmeet the 11% native preference plus an additional 2%  added to the percentage scale; making \nthe total preference percentage 13%.  \nTherefore , the Mohawk bidder ’s bid must meet or be lower than $54,240 to be eligible for the \naward . \n \nA. Slidi ng Scale Calculation Formula  \nNative American Preference  shall be applied to all acquisitions for goods and services \nfor the Saint Regis Mohawk Tribe.  Specifically, for the acquisition of goods and \nservices where price is the determining factor, the prefer ence shall be applied in \naccordance with the sliding scale below and by the following steps:  \n1. Determine low bidder (L).  \n2. Based on scale, calculate the percent based on low bidder’s price (P).  \n3. Add percentage to low bidder’s price which gives the max bid (MB) for the \nNative American Owned Business or Company.  If the Native bid, (N) is less \nthan this amount, the native gets the award.  \n4. So, the calculation is (L x P) + L =MB.  If N<MB, Native gets the award.  \n5. Where price is NOT the sole determining factor, i.e. in  RFPs, Native American \nPreference  may be applied in the proposal review evaluation by the awarding of \nadditional points for those Native proposers who qualify.  The Native American \nPreference  applied shall be the percentage of the total amount of points \navailable in the evaluation form.  \n6. An additional 2% or points (which ever applies) for Mohawk individuals or \nbusinesses also shall be applied if eligible.  \nThe Native American /Mohawk  Preference shall be applied to either  proposal \nevaluation points and to pro posal bid price in accordance with the scale \noutlined above , whichever has a higher preference value . \nIn any circumstance, the Native American Preference  must be applied after all bidders \nor proposers are deemed qualified.  Note that Native American Prefer ence cannot \novercome the lack of responsiveness, responsibility or qualification of a bidder.   \n Native American Preference Policy  \n Version 003  Page 6 of 12 \n SECTION 2  \nCONSTRUCTION   \nNATIVE AMERICAN PREFERENCE STANDARDS  \n \nI. CONSTRUCTION – NATIVE AMERICAN PREFERENCE STANDARDS  \nA. Policy Statement:  It is the policy of the Saint Regis Mohawk Tribe to cultivate a \nstrong Native American workforce for all construction contracts and subcontracts \nof the Tribe including those of all tribally -owned and operated entities. In addition \nto the Native American Preference  in the i ssuance of awards, the Tribe also \nrequires  the hiring of  Native  Americans  for the performance of any construction  \ncontracts with the Tribe  or its entities . Therefore,  all successful  bidders shall  \nsubmit a Native American Preference  Employment  Plan to the SRMT \nCompliance Department . \nB. Individuals or Businesses that are registered/certified as Mohawk Owned \nBusinesses shall be granted an extra 2% or 2 points in the evaluation for \nconstruction . \nC. Solicitation of Bids : The Tribe shall solicit construction contracts in accordance \nwith the Tribe’s Contract and Procurement Policy .  \nTribal entit ies, subsidiar ies, and enterprise s, including, but not limited to, the \nAkwesasne Housing Authority and Mohawk Gaming Enterprises, LLC shall \nadhere to their respective procurement of goods, services, and construction \ncontract  policies  while incorporating the Native Preference Policy.  \nII. CONSTRUCTION – SLIDING SCALE   \nA. Construction Contract Award .  An a ward shall be made under unrestricted \nsolicitations to the lowest responsible bid from a qualified Native American \nowned business or company , if the bid is no more than \"X\"  amount  higher than \nthe total bid price of the lowest responsible bid from any quali fied bidder. The \nfactor \"X\" is determined  when the lowest responsive bid  is as follows : \nLowest Bidder Amount  Preference % Applied  \nless than $100,000  10% of that bid, or $9,000  \nAt least $100,000, but less than $200,000  9% of that bid, or $16,000  \nAt least  $200,000, but less than $300,000  8% of that bid, or $21,000  \nAt least $300,000, but less than $400,000  7% of that bid, or $24,000  \nAt least $400,000, but less than $500,000  6% of that bid, or $25,000  \nAt least $500,000, but less than $1 million  5% of that  bid, or $40,000  \nAt least $1 million, but less than $2 million.  4% of that bid, or $60,000  \nAt least $2 million, but less than $4 million  3% of that bid, or $105,000  \nAt least $4 million, but less than $7 million  2% of that bid, or $105,000  \n$7 million or  more...  1.5% of the lowest responsive bid, w/ no dollar limit  \n \n Native American Preference Policy  \n Version 003  Page 7 of 12 \n B. Factors other than Price .  Factors, other than pricing, shall affect whether a firm \nis \"qualified\" to be awarded a contract. In these instances, the RFP (request for \nproposals) shall clearly identify the relative importance of price and other \nevaluation factors and sub -factors, including the weight given to each technical \nfactor and sub -factor.  The proposals shall be evaluated only on the criteria stated \nin the request for proposals .  Native American Preference  may be applied as a \npercentage of identified proposal evaluation points,  awarding  10%.   \n \nAn additional 2% or 2 points for Mohawk individuals or businesses  also shall be \napplied if eligible.   \n \nThe Native American/Mohawk Preference shall  be applied to either proposal \nevaluation points and to proposal bid price in accordance with the scale outlined \nabove, whichever has a higher preference value.  \n \nAward of Bids:   The award shall be made to the qualified company with the \nlowest responsible bid after the Native American Preference  factor has been \napplied.  The Native American Preference  factor may be utilized for any bidder \nwho is an approved NAOB that provide s a Native American Preference  \nEmployment Plan.  \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n Native American Preference Policy  \n Version 003  Page 8 of 12 \n SECTION 3  \nConstruction  Native American Preference Plan Requirements  \nI. Construction  – Native American Preference  Employment Plan Requirement  \nA. The Tribal Council mandates that all construction contracts awarded by the Tribe , any \nTribal entity, subsidiary, or enterprise including , but not limited to, the Akwesasne \nHousing Authority  and Mohawk Gaming Enterprises, LLC , shall include a Native \nAmerican Preference  Employment Plan for all Construction Contracts . \nB. The Native American Preference  Employment Plan requires the successful Genera l \nContractor , and all sub -contractors subsequently hired by the General Contractor,  to \nemploy at least fifty percent  (50%) qualified Native American  workers  per division \nfor the project , i.e. electricians, carpenters, plumbers,  roofers,  etc.  \nC. The General Contractor and the Subcontractors shall be required to employ at least \nsixty  percent ( 60%) unskilled positions with qualified Native Americans.  \nD. The General Contractor and all sub -contractors shall maintain the established 50% \nand 60% Native emp loyment benchmarks throughout the duration of the project and, \nwherever possible, the General Contractor and sub -contractors shall endeavor to \nexceed these benchmarks.  \nE. The successful General Contractor’s Native American Preference  Employment Plan \nshall be provide d upon request of the SRMT Contracting Officer . \nF. The General Contractor shall ensure all sub-contractors  comply with  the requirements \nof the  Native American Preference  Employment Plan  by submitting a “Plan” for each \nsubcontractor after receipt of a Notice of Award and before the contract has been \nexecuted . \nG. The General Contractor may request an exemption from this policy in writing to the \nTribal Council at any given time in the construction phase.  Tribal Cou ncil may grant \nthe exception upon documented proof that there are fewer than 50% qualified Native  \nAmerican  workers in a particular trade (s) or 60% unskilled workers and that the \nGeneral Contractor or sub -contractor (s) has(have)  made a reasonable effort to comply \nwith this policy . \nH. For the purpose of sub-contracting  a portion of the contract , the Compliance  \nDepartment  shall maintain an updated list of all certified Native American companie s \nand will provide the list to potential bidders , upon request . \nI. This list of NAOB shall include the specific types of work for which the firm is \ncertified  and qualified  to perform . Any firm not included on the list at the time an \nInvitation for Bids (IFB)  or Request for Proposals (RFP)  is issued, cannot challenge \nthe bid process due to failure to receive the bid solicitation . \nJ. The Grants and Contracts Office shall verify the company’s  NAOB  Certification with \nthe SRMT Compliance Department  as part of the qualified bidder verification \nprocess .  \nK. The following statement shall be included in all Request for Proposal / Invitation for \nBids:  The General  Contractor  shall refer  to the Akwesasne Employment \nResource Center for assistance with finding q ualified  and unskilled  Native  \nAmerican workers.    \n Native American Preference Policy  \n Version 003  Page 9 of 12 \n SECTION 4  \nCOMPLIANCE & ENFORCEMENT  \n \nI. MANDATORY COMPLIANCE  \nA. SRMT Compliance Department shall ensure the following:   \ni. All contractors comply with this policy and the submitted Native American \nPreference Employment Plan unless a waiver is granted in writing by Tribal \nCouncil.  \nii. The SRMT Compliance Department may stop work on construction whenever \nthere is a failure  to meet the Native American Preference Employment Plan \nrequirements, as outlined in Section 3 of this policy or who have not been \ngranted a waiver.  \nB. The Grants and Contracts Office and Procurement Office shall ensure compliance \nwith this policy during and throughout the purchasing and/or contracting process for \ngoods and services and construction co ntracts.  \ni. Upon receipt of a  fully  executed contract, the Compliance Department \nbecomes responsible for oversight and enforcement of this policy.  \nC. Tribal Council may waive compliance when an emergency threatens the health, safety \nor welfare of the Tribe or i ts members and compliance would increase the threat.  \n \nII. COMPLIANCE ENFORCEMENT  \nA. The Tribal Representative/Project Manager of each construction contract shall \nprovide a monthly Native American Preference Employment Plan report and submit \nit to the Grants and C ontract Office and the SRMT Compliance Department.  \nB. The SRMT Compliance Department shall conduct regular inspections of the worksite \nto observe compliance to this policy and furnish reports of their inspections for record \nkeeping.  \nC. Financial Penalty:  \ni. The Gr ants and Contracts Office shall outline the following in the bid process \nand contract:  \na. If the general contractor fails to meet the Native American preference \nemployment plan  submitted , and has not been granted a waiver by Tribal \nCouncil, the contractor shall be issued a $250 or 10 % non -refundable fine \nper infraction, per trade per occurrence and may be barred from future \nSRMT construction and/or service contracts.   \n \n \n \n \n \n Native American Preference Policy  \n Version 003  Page 11 of 12 \n Appendix B  \nNATIVE AMERICAN OWNED BUSINESS  \nCERTIFICATION PROCESS  \nUNDER THE NATIVE PREFERENCE POLICY  \nI. GENERAL REQUIREMENTS:   \nAn applicant seeking to qualify for Native American Preference for the purpose of doing \nbusiness with the Saint Regis Mohawk Tribe as a 100% Mohawk owned business \nenterprise, a majority -owned Mohawk business enterprise, or other Native American or \nFirst Nations business enterprise shall subm it proof of the applicant's ownership and \ncontrol , as identified below, to the Compliance Director. The Compliance Director shall \ncertify an applicant business including but not limited to Corporation, Limited Liability \nCompany or any individual with a doi ng business as certificate (each a “Business” or \n“Enterprise”) has the minimum ownership and control requirements for the applicable \npreference category.  \nA. The following ownership and control requirements are applicable to each preference \ncategory and are a s follows:  \nII. MOHAWK OWNED BUSINESS  \nA. Ownership:  Enrolled or eligible to be enrolled members of the SRMT must own 51% \nor more of the business.  \nB. Control:  Enrolled or eligible to be enrolled members of the SRMT must exercise \nmajority control of the business, and be substantially involved in the management and \noperations of the Business.  \nIII. NATIVE AMERICAN OWNED BUSINESS  \nA. Ownership:  Enrolled members of a federally recognized tribe, band, nation, including \nAlaska Native must own at least 51% of the business.  \nB. Control:  Enrolled members of a federally recognized tribe, band, nation, including \nAlaska Native must exercise majority control of the business and be substantially \ninvolved in the management and operations of the business.    \nIV. CERTIFICATION PROCEDURES   \nA. The certification process may take up to twenty -one (21)  business  days.    \nB. A Business seeking certification for any preference pursuant to this Native American Preference \nPolicy shall submit a complete Mohawk/Native Owned Business Certification application to t he \nCompliance Department Director.  \nC. The Application is available within the Compliance Department Office.  \nD. Compliance Department staff may be available to assist a Business in filling out the application, \nrequest such additional information as it believes appropriate to conduct such investigations as it \ndeems appropriate, and make a final written finding to certify or not to certify. The Compliance \n Native American Preference Policy  \n Version 003  Page 12 of 12 \n Director may extend the processing period by an additional twenty -one (21) days, by sending \nnotification of th e extension to the Applicant by registered mail  or electronic mail (email).   \nE. There will be a set certification fee established by the Compliance Department and approved by \nTribal Council and shall be posted on the appendix of the application .  \nF. The applican t must complete the application and submit receipt of payment to the Compliance \nDepartment before the application is examined for certification  \nG. The Compliance Department will verify the information provided to ensure the applicant meets \nthe Mohawk or Nativ e Owned Business requirements.  \nH. Once verification is complete, the Compliance Director shall issue a two -year certification to the \nBusiness.  \nI. Business must recertify every two years.  \nJ. If the application is denied due to lack of information or otherwise, th e Compliance Director shall \nissue a notice to the Business with five days of determination.  \nK. The Business shall have the option to appeal this decision to the SRMT Tribal Council.  \nV. SUSPENSION OR WITHDRAWAL OF CERTIFICATION  \nA. From the information provided in any credible  reports, or on the basis of a written grievance filed by \nany other business or person, , the Compliance Department Director may initiate an investigation into \nthe validity of any reports and must document the concerns, or statements of possibl e false \ndocumentation or that a business has not provided current ownership has changed to not qualify under \nthis Ordinance.   \nB. Should the initial investigation indicate valid findings, the Director shall begin  proceedings to consider \na withdraw or suspen sion of  the certification of the  said Business. The Compliance Department Director \nshall prepare an analysis of findings and shall send the Business notice, by registered mail  or electronic \nmail (email) , that its certification is being  \nC. Suspended,  along with  the grounds for removing the certification. A Business may appeal any finding \nof certification withdrawal or suspension to the Compliance Department Director and submit whatever \ndocuments it deems necessary to counter the findings. After reconsidering the  withdrawal, the \nCompliance Department Director may:  \ni. Withdraw certification;  \nii. Suspend certification for up to one year;  \niii. Put the Business on probation; and/or  \niv. Order that corrective action be taken within a fixed period.  \nD. A Business that has had its certi fication withdrawn or suspended may not reapply for a period of one \n(1) year from the time it is withdrawn or suspended.  \nE. Change in Status and Annual Reports:  Each certified firm shall report to the Compliance Department \nDirector, in writing, any changes in its ownership or control status within thirty (30) days after such \nchanges have occurred. Each certified firm, on the anniversary of its receipt of permanen t \ncertification, shall update the information provided in this initial application on an annual report form \nprovided by the Compliance Department. Failure to provide information pursuant to these \nrequirements shall constitute grounds for Compliance Departm ent Director to move for withdrawal of \ncertification.  \nSRMT Combined Certifications\nLOBBYING CERTIFICATION \nAs required by Section 1352, title 3 1 of the U.S. Co de the Contractor certifies : \n(a) that no Federal appropriated funds have been paid or will be paid by or on behalf of the undersigned to any person for influencing or attempting\nto influence an officer or employee of any agency, a Member of Congress, an officer or employee in connection with the awardi ng of any Federal\ncontract, the making of any Federal grant, the making of any Federal loan, t he entering into of any cooperative agreement and the extension,\ncontinuation, renewal, amendment or modification of any Federal contract, grant, loan, or cooperative agreement;\n(b)if any funds other than Federal appropriated funds have been paid or will  be paid to any person for influencing or attempting to influence an officer\nor employee of any agency, a Member of Congress, an officer or employee of Congress, or an employee of a member of Congress i n connection with\nthis contract, grant, loan or cooper ative agreement, the undersigned shall complete and submit Standard Form A -LLL “Disclosure Form to Report\nLobbying,” in accordance with its instructions.\n(c) this certification is a material representation of fact upon which reliance is placed when this t ransaction is made or entered into.  Submission of this\ncertification is a prerequisite for making or entering into this transaction imposed by Section 1352, Title 31, U.S. Code.  Any person who fails to file\nthe required certification shall be subject to a civil penalty of not less than $10,000 and not more than $100,000 for each such failure.\nCERTIFICATION REGARDING DEBARMENT  \n1.As required by Executive Order 12549 Debarment and implemented at 48 CFR Part 9.4, or as amended, Contractor certifies that it and its principals \n(checkmark is required  for each letter a -f):\n(a) are ___ (or) are not____ presently debarred, suspended, proposed for debarment, or declared ineligible for the award of contracts by any\nFederal, State, Local or Tribal Agency; and\n(b) have ___ (or) have not ____ within a 7- year period preceding this offer, been convicted of or had a civil judgment rendered against him for:\ncommission of fraud or a criminal offense in connection with obtaining, attempting to obtain, or performing a public (Federal , state, Tribal or local) \ncontract or subcontract; violation of Federal or state antitrust statutes relating to the submission of offers; or commission of embezzlement, theft,\nforgery, bribery, falsification or destruction of records, making false statements, tax evasion or receiving stolen property;  and\n(c) have ____ (or) have not ____ within a 7 -year period preceding this offer, been found guilty of or entered a plea of nolo contendere or guilty to \nany offense under Federal, State, Local or Tribal Law involving crimes of violence, sexual assault, sexual molestation, sexua l exploitation, se xual\ncontact or prostitution, or crimes against persons or has been convicted of an offense involving a child victim, a sex crime,  or a drug felony; and\n(d) are ____ (or) are not ____  presently indicted for, or otherwise criminally or civilly charged by a Governmental entity (Federal, State, Local or\nTribe) with, commission of any of the offenses enumerated in (b) or (c ) of this provision; and\n(e) have ___ (or) have not ____ within a 7 -year period preceding this offer had a civil or criminal judgement rende red against them by a tribal court \nfor any offense related to Indian Preference laws (including TERO provisions) or had a civil judgement rendered against them relating to the firm’s status as an Indian contractor; and  \n(f) have ____ (or) have not ____ with in a 7- year  period preceding this offer had one or more contracts (Federal, State, Local or Tribal) terminated\nfor cause or default.\n2.Contractor shall provide immediate written notice to the Contracting Officer if, at any time prior to or after contract award, the Contractor learns\nthat its certification was erroneous when submitted or has become erroneous by reason of changed circumstances.\n3.The Contractor shall submit a recertification annually in a multi -year agreement.\n4.A certification that any  of the items in paragraph 1 of this provision exists will not necessarily result in withholding of an award under this\nsolicitation.  However, the certification will be considered in connection with a determination of the Contractor’s responsib ility.  Fai lure of the\nContractor to furnish a certification or provide such additional information as requested by the Contracting Officer may render the Contractor non -\nresponsible.\n5.Nothing contained in the foregoing shall be construed to require establishment of a system of records in order to render, in good faith, thecertification required by paragraph 1 of this provision.  The knowledge and information of a Contractor is not required to exceed that which is\nnormally possessed by a prudent person in the ordi nary course of business dealings.\n6.This certification concerns a matter within the jurisdiction of an agency of the United States and the making of a false, fictitious, or fraudulentcertification may render the make subject to prosecution under section  1001, title 18, United States Code.\n7.The certification in paragraph 1 of this provision is a material representation of fact upon which reliance was placed when m aking award.  If it is\nlater determined that the Contractor knowingly rendered an erroneous certification, in addition to other remedies available to the Tribe, the\nContracting Officer may terminate the contract resulting from this solicitation for default.\n8.Principals, for the purposes of this certification, means officers, directors, owners, partners, and persons having primary management or\nsupervisory responsibilities within a business entity (e.g. general manager, plant manager, head of a subsidiary, division or  business segment and\nsimilar positions).\nCERTIFICATION REGARDING  DRUG -FREE WORKPLACE  \nIn accordance with  48 CFR Pa rt 23, the Contractor certif ies that they  will provide a drug -free workplace by:  \n(a)publishing a statement notifying employees that the unlawful manufacture, distribution, dispensing, possession or use of a controlled substance is\nprohibited in the CONTRACTOR’s workplace and specifying the actions that will be taken against employees for violation of such prohibition;\n(b)establishing a drug -free awareness program to inform employees about:RFP No. 25-0037 Attachment \"B\"\n1. the dangers of drug abuse in the workplace;\n2. (the CONTRACTOR’s policy on maintaining a drug -free workplace;\n3. any available drug counseling, rehabilitation, and employee assistance programs; and,\n4. the penalties that may be imposed upon employees for drug abuse violations occurring in the workplace;\n(c)Making it a requirement that each employee to be engaged in the performance of this Agreement be given a copy of the statemen t required by\nparagraph (a);\n(d)Notifying the employee in the statement required by paragraph (a) t hat, as a condition of employment under this Agreement, the employee will:\n1. abide by the terms of the statement; and\n2. Notify the employer of any criminal drug statute conviction for a violation occurring in the workplace no later than five day s after such\nconviction;\n(e)Notifying the OWNER within ten days after receiving notice under subparagraph (d)(2) from an employee or otherwise receiving actual notice of\nsuch conviction;\n(f) Taking one of the following actions, within 30 days of receiving notice under  subparagraph (d)(2), with respect to any employee who is so convicted:\n1. Taking appropriate personnel action against such an employee, up to and including termination; or\n2. requiring such employee to participate satisfactorily in a drug abuse assistance or rehabilitation program approved for such purposes by a\nFederal, State or local health, law enforcement, or other appropriate agency;\n(g)Making a good faith effort to continue to maintain a drug -free workplace through implementation of paragraphs (a) , (b), (c), (d), (e) and (f).\nCERTIFICATION REGARDING  TRAFFICKING IN PERSONS COMPLIANCE PLAN (MAR 2015)  \nIn accordance with  48 CFR Part 22  the Contractor certifies  that: \n(a) They have adopted a zero tolerance policy in regarding trafficking in person.  Contractors and Contractor employees shall not:\n1. Engage in severe forms of trafficking in persons during the period of performance of the contract;\n2. Procure commercial sex acts during the period of performance of  the contract; or\n3. Use forced labor in the performance of the contract.\n(b) They have notified its employees of –\n1. The United States and Saint Regis Mohawk Tribe’s zero tolerance policy described in paragraph (a) of this clause; and\n2. The actions that will be taken against employees for violations of this policy.  Such actions may include, but are not limited to, removal fromthe contract, reduction in benefits or termination of employment, and\n(c) Take appropriate action, up to and including termination, against employees or subcontractors that violate the policy in paragraph (a) of this clause.\n(d) Notify the Saint Regis Mohawk Tribe immediately of –1. Any information it receives from any source (including host country law enforcement) that alleges a Contractor’s employees, s ubcontractor,\nor subcontractor employees has engaged in conduct that violates this policy; and\n2. Any actions taken against Contracto r’s employees, subcontractor, or subcontractor’s employees pursuant to this clause.\n(e) Contractor’s failure to comply with the requirements may result in –\n1. Requiring the Contractor to remove a Contractor employee or employees from the performance of the cont ract;\n2. Requiring the Contractor to terminate a subcontract;\n3. Suspension of contract payments,\n4. Loss of award fee, consistent with the award fee plan, for the performance period in which the Government determined Contractor non-compliance;\n5. Termination of the C ontract for default or cause, in accordance with the termination clause of this contract; or\n6. Suspension or debarment.\n(f) Include the substance of this clause, including this paragraph in all subcontracts.\nANTI-COLLUSION STATEMENT \nIn the  preparation and submission of this offer on behalf of the undersigned company,  we did not either directly or indirectly enter into any combination \nor arrangement with any person, firm or corporation, or enter into any agreement, participate in any collusion, or otherwise take any action in the \nrestraint of free competition in violation of the Sherman Anti -Trust Act, 15 USCS, Sections 1 et seq. The undersigned vendor hereby certifies that this \nagreement, or any claims resulting there from, is not the result  of, or affected by, any act of collusion with, or any act of, another person or persons, firm \nor corporation engaged in the same line of business or commerce; and that no person acting for, or employed by the Saint Regis Mohawk Tribe has an \ninterest in, o r is concerned with this proposal; and that no persons, firm or corporation, other than the undersigned, have or are interest ed in this \nproposal.  \nAs the duly authorized representative of the Contractor , I hereby certify, under penalties of perjury, that  the Contractor  will comply with the above \ncertifications.  \nPRINTED NAME OF CONTRACTOR/COMPANY:  \nPRINTED NAME AND TITLE OF AUTHORIZED REPRESENTATIVE:          SIGNATURE OF REPRESENTATIVE AND DATE SIGNED:  \nSaint Regis Mohawk Tribe \nRESPIRATORY VIRUS \nWORKPLACE SAFETY POLICY \nVERSION 011 RFP No. 25-0037 Attachm ent \"C\"\nResoiratorv Virus \nWorkplace Safety Policy \nPolicy Statement \nOn March 1st 2024, the US Centers for Disease Control (CDC) updated and simplified its COVID-\n19 guidance . The updated CDC guidance establishes a unified approach to all respiratory \nviruses. \nOur updated tribal policy, version 011, will largely reflect the updated CDC guidance and will \nnow be known as the Respirato ry Virus Workplace Safety Policy. \nScope \nThis policy is applicable to the following covered individuals: \n-Tribal employees and elected officials \n-Tribal Commiss ion and Board members \n-Tribal General Contractor s and sub-contractors, and their employees \nResponsi bi I ity \nIt is the responsibility of all covered individuals to adhere to and take the necessary measures \nto protect themselves and those around them. \nReporting to Work \nAll covered individuals must screen themselves for any symptoms of illness prior to reporting to \nwork. \nAll covered individuals shall not physically report to work if they are exhibiting symptoms of \nrespiratory virus including fever, congestion, cough, headache, runny nose, sore throat or \nfatigue. If exhibiting any of these symptoms, it is suggested that the individual test for COVID, \nInfluenza or RSV. // in doubt, wear a mask at your work site. \nVersion 011 SRMT Respiratory Virus Workplace Safety Policy Page 1 of 3 \nReporting of Positive COVID-19 Test Results \nEmployees testing positive for COVID-19 are required to inform their supervisor \nimmediately . \nIf symptoms are present the employee must go home. \nIf no symptoms are present following a positive test, the employee may continue to work \nbut must wear a surgical level or higher mask. \nSick leave due to COVID, RSV or influenza in excess of three days will require a doctor's note, \nconsistent with the SRMT Employee Handbook. \nReturning to Work following Respiratory Virus Illness \n'Employees and other covered individuals may return to work 24 hours after symptoms \nimprove, and when they have been fever-free for 24 hours without use of medication. \nOnce the employee or other covered individual returns to work, a surgical level or higher \nmask must be worn for 5 calendar days. \nTelecommuting Standards \nTelecommuting arrangements and expectations are established between supervisor and \nemployee for those positions eligible to telecommute . Telecommute schedules must be \napproved by supervisors ahead of time. \nEmployees must be available to respond to work duties while telecommuting during the \ndesignated hours of operation. Employees who are telecommuting must respond in a timely \nfashion to SRMT colleagues (within 60 minutes, generally) and must be available for phone calls \nwhen required. \nStaff have been entrusted with computer hardware and software to use while telecommuting. \nStaff are expected to secure all tribal property and data while granted telecommute privileges. \nUse of tribal hardware and software by family members or any non-employee is prohibited. \nViolations of this requirement may result in loss of privileges to utilize tribal hardware and \nsoftware outside of the office setting. \nDivision Directors , Program Managers, and other Supervisors are expected to be physically \npresent to lead their teams within the office setting as much as possible. \nTribal Programs may seek to establish additional, more-stringent measures, should unique \nneeds and exposure risks be present. Such requests will be subject to review by and approval of \nthe Executive Director. \nVersion 011 SRMT Respiratory Virus Workplace Safety Policy Page 2 of 3 \nConseg uences \nEmployees are expected to adhere to the standards outlined in this document . Violations of \nthis policy are subject to disciplinary action, up to and including termination . \nAmendments \nThe standards outlined in this document will be updated from time to time as public health \nofficials provide new information or until the Tribe's Employee Handbook is updated to address \nCOVID-19 and respiratory virus safety in the workplace . \nEffective Date \nThis document shall take effect on the date of adoption by the Executive Director. \nDocument Approval \nThis is to certify that the Saint Regis Mohawk Tribe, pursuant to the authority delegated to the \nExecutive Director, approves the Respiratory Virus Workplace Safety Policy Version 011. \n~~~ \nTsiorasa Barreiro \nExecutive Director \nVersion 011 SRMT Respiratory Virus Workplace Safety Policy Page 3 of 3 \nSRMT GENERAL CONTRACT TERMS AND CONDITIONS  \nPage 1 of 3 V6, October 2023 1. Definitions : The following words shall be defined as set forth below:\na.“Agreement” or \"Contract\" means all terms and conditions herein and all \nattachments attached hereto.\nb.\"Contractor \" or “Consultant” means the person or entity whose name \nappears on the signature page of the written agreement and is the party who \nwill perform the services/ work .\nc.\"Tribal Chief\" means one of the three Tribal Chiefs of the Saint Regis\nMohawk Tribe.\nd.“Executiv e Director” means the Executive Director of the Saint Regis\nMohawk Tribe.\ne.\"St. Regis Mohawk Tribe\", “Saint Regis Mohawk Tribe”, “SRMT”, “Tribe”\nor \"Tribal Government\" means The Saint Regis Mohawk Tribe, a federally recognized Tribe.\nf. \"Service\" or “Work” mea ns all effort to be expended by Contractor as set \nforth in the Statement /Scope  of Work.\ng.“Statement of Work” or “Scope of Work” means the document that \ndescribes the Services to be provided by Contractor including the tasks, \ndeliverables and milestones.\nh.“Records” means all technical documents, reports, pictures, computer\n,\ns\noftware, floppy discs, maps, studies, surveys, drawings, plans ,\ns\npecifications, and any other documentation used under this Contract . \ni.“Tribal Representative” means t he SRMT employee who is designated to \nperform any of the SRMT’s functions  under the agreement  and who will \noversee all Work/Services being performed by the Contractor . \n2\n.GENERAL PROVISIONS.  \na) Records and Documents.  The Contractor  shall during the term of this\ncontract, and for a period of seven (7) years from the date of completion of the \nagreement, maintain and keep full records of their estimates of and actual cost\nto them of the work together with all proper quotations, contracts,\ncorrespondence, invoices, receipts and vouchers relating thereto, and shall make them available for copy, audit or inspection by any person acting on \nbehalf of the SRMT.\nb) Ownership of Materials and Documents .  All documents , reports  or other\nmaterials developed or discovered by Contractor  or any other person engaged\ndirectly or indirectly by Contractor  to perform the services /work  required\nhereunder shall be and remain the property of SRMT without restriction orlimitation upon their use.  \nc) Copyright .  Contractor hereby assigns to the SRM T all right, title, and\ninterest in and to the work resulting from the services under this Agreement,including but not limited to all copyright and all rights subsumed thereunder.\nd) Confidentiality .  The Contractor shall treat as confidential, during as well \nas after the performance of any work under this Contract, any information, including any personal information, to which the Contractor becomes privy as\na result of acting under the Contract.   For more certainty,  the Contractor shall \nnot disclose any information, that is gained from any work connected to thiscontract, to any other person or party which is not participating in the Contract \nin a form that could reasonably be expected to identify the person includin g \nindividuals, to which such information relates.\ne) Advertising .  The Contractor  shall not allow or permit any use, in any way,\nin any product literature or advertising the services provided under this\ncontract without the written permission of the SRMT.\nf) Amendments .  The SRMT is responsible for the management of the \ncontract and any changes to the contract must be authorized by a contract\namendment issued by the SRMT.\ni. The Contractor  is not to perform work in excess of or outside the scope \nof this contract based on verbal or written requests . \nii.No amendment of the contract nor waiver of any of the terms and \nprovisions shall be deemed valid unless confirmed by a written amendment.  \ng) Conflict of Terms .  In case of conflict between the terms of the \nContractor’s proposal /quote  and this Contract , the terms contained in this \nContract shall control.\nh) Severab ility.  Should any provision of this Contract  be held invalid or\nunenforceable by any court of competent jurisdiction, the remaining provisions\nshall remain in full force and effect.   The inapplicability or unenforceability of\nany provision of this Contract shall not limit or impair the operation or  validity \nof any other provision of the Agreement.  \ni) Counterparts .  The Agreement may be executed in two or more \ncounterparts, each of which shall be deemed an original but all of which together constitute s one and the same Agreement.   The counterparts of  this\nAgreement and all Ancillary Documents may be executed and delivered by facsimile or other electronic signature by any of the parties to the other party\n;\na\nnd the receiving party may rely on the receipt of such document so executed\nand delivered by fac simile or other electronic means as if the original had been\nreceived.j) E\nntire Agreement . The Contract constitutes the entire agreement between\nthe parties with respect to the subject matter of the agreement and supersedesall previous negotiations, communications and other agreements relating to itunless they are incorporated by reference in the agreement. \nk) Notice .  Any notice shall be in writing and may be delivered by hand or by \ncourier, by registered mail, or by facsimile or other electronic me ans that \nprovides a paper record of the text of the notice, addressed to the Party forwhom it is intended at the address in the Contract or at the last address of\nwhich the sender has received notice in accordance with this section.  Any notice shall be d eemed to be effective on the day it is received at that address.\nl)\nE\nxecu tory Clause.   Contractor understands and acknowledges that the \nSRM T shall have no liability under this Contract to the Contractor or to anyone \nelse beyond funds appropriated and available for this Contract.  \n3\n.RELATIONSHIP OF THE PARTIES.  \na)\nIndependent Contractor.   This Agreement shall not render the Contractor  \nan employee, partner, agent of, or joint venturer with the SRMT for any \npurpose.  The Contractor  is and will remain an in dependent contractor in their\nrelationship to the SRMT.  The SRMT shall not be responsible for withholding taxes with respect to the Contractor ’s compensation hereunder.  The Contractor \nshall have no claim against the SRMT hereunder or otherwise for vacati on pay, \nsick leave, r etirement benefits, social security, worker’s compensation, health\nor disability benefits, unemployment insurance benefits, or employee benefitsof any kind.  \nb) E\nmployer/Employee Relationship . The Contractor  will act as an\nindependent Contractor and no master -servant relationship between SRMT and\nthe Contractor  is contemplated or implied by this Agreement.   If during the \nprogress of the work it is determined that a relationship of employer and employee between the SRMT and the Contractor  has developed in the work,\nthis Agreement will upon such determination be considered to be at an end and the Contractor  shall be entitled to be paid only for the work completed up to \nthe time of such determination less any am ounts theretofore paid on account of\nsuch work.c) Authority .  Contractor  shall not have the authority to enter into any\nagreement to bind the SRMT and shall not represent to anyone that the \nContractor  has such authority.\nd) Conflict of Interest.  Contractor represents and warrants that it has no\nbusiness, professional, personal, or other interest that would conflict in any \nmanner or degree with the performance of its obligations under thisAgreement.   Further, Contractor agrees that no employee of the SRMT who \nhas exercised or will exercise any authority over the specifications,procurement, supervision or payment for this Agreement, and no member of\nthe employee’s immediate family, has had or will have any direct or indirect \nfinancial interest in t his Agreement.   If any such actual or potential conflict of\ninterest arises under this Agreement, Contractor shall immediately inform the \nSRMT Representative.\n4\n.LAWS, REGULATIONS AND TRIBAL CODES.  \na) Applicable Laws .  The contract shall be governed by Saint Regis Mohawk\nTribal law.  If there is no applicable tribal law, the application of law shall \ncomply with the SRMT Civil Code, Section V, which sets forth the priority of\nlaw as applied by the Tribal Court.  Any dispu tes regarding claims under this\nContract shall be presented to the SRMT Courts for resolution.  Contractor \nconsents to jurisdiction in the SRMT Court and to service of process under\ntribal law in any action commenced regarding this Contract.\nb) Complian ce.  The Contractor  represents, warrants and agrees to perform the \nWork in compliance with all applicable tribal regulations and ordinances, federal, \nstate, and applicable local laws. \nc) Corporate Compliance Policy .  The SRMT is a recipient of Department of\nHealth and Human Services and other federal and state funding.  Therefore, all \ncontractors must be screened, prior to and for the duration of the Contract,\nagainst the Department of Health & Human Services/Office of  Inspector \nGeneral and The System for Award Management (SAM) exclusion database.\nIf it is determined at any time that the Contractor made a false declaration,\nSRMT will have the right to terminate the Contract/Agreement for default.The Contractor and any of its affiliates also are required to remain free and\nclear of any acts or conv ictions specified herein during this Contract.\nd) Native Preference.  T he Contractor shall require to the greatest extent\nfeasible -Preferences and opportunities for training and employment in connection \nwith the administration of contracts be given to Indians; and preference in the \naward of subcontracts in connection with the a dministration of such contracts shall \nbe given to Indian organizations and to Indian -owned economic enterprises as \ndefined in 25 U.S. Code §1452.  \ne) Certifications .  During the performance of this Agreement, the Contractor\nagrees to comply with the requirements of the SRMT Combined Certifications\ncontaining Certification Regarding Drug Free Work Place, Certification RFP No. 25-0037 A ttachment \"D\"\nSRMT GENERAL CONTRACT TERMS AND CONDITIONS  \n \nPage 2 of 3  V6, October 2023 Regarding Debarment, Lobbying Certification, Certification Combating \nTrafficking in Persons and Anti -Collusion Statement.  \n \n5. INDEMNIFICATION, LIABILITY  AND TERMINATION.  \na) Force Majeure/Excusable Delay: Neither party hereto will be liable or \nresponsible to the other for any loss or damage or for any delays or failure to \nperform due to causes beyond its reasonable control including, but not limit ed to, \nacts of God, strikes, epidemics, war, riots, flood, fire, sabotage, or any other circumstances of like character. \nb) Indemnification:  The Contractor shall indemnify and save harmless the \nSaint Regis Mohawk Tribe, its agents, contractors, subcontractors, employees, and officers harmless from all liability, real or alleged, in connection with the \nperformance of work on this project, except for liability arising directly from \nthe negligence of the Saint Regis Mohawk Tribe and its officers, employees, \nand agents.  \nc) Termination for Convenience:  Upon thirty (30) days prior written notice, \nthe SRMT reserves the right to terminate this contract, or any part hereof, for \nits sole convenience. In the event of such termination, the Contractor  shall \nimmediately stop all work hereunder and shall immediately cause any and all \nof its suppliers and S ub-Contractor s to cease work. Subject to the terms of this \nagreement, the Contractor  shall be paid a percentage of the contract price \nreflecting the percentage of the work performed prior to the date of \ntermination, plus reasonable charges that the Contractor  can demonstrate to the \nreasonable satisfaction of the SRMT, using its standard record keeping system, \nhaving resulted from the termination. The Con tractor  shall not be required to \ncomply with the cost accounting standards or contract cost principles for this purpose. This paragraph does not give the SRMT any right to audit \nContractor’s records.  The Contractor  shall not be paid for any work performed  \nor cost incurred that reasonably could have been avoided.  \nd) Termination for Cause:  Either party may terminate this agreement, or any \npart hereof, for cause in the event of any default by the other party.  SRMT may also terminate this agreement if the Co ntractor  fails to comply with any \nagreement terms and conditions, or fails to provide the SRMT, upon request, \nwith adequate assurances of future performance. In the event of termination for \ncause, the SRMT shall not be liable to the Contractor  for any amount for \nsupplies or services not accepted, and the Contractor  shall be liable to the \nSRMT for any and all rights and remedies provided bylaw. If it is determined \nthat the SRMT improperly terminated this contract, for default, such \ntermination shall be deemed a termination for convenience, so long as the \nSRMT has complied with the notice pr ovisions set forth herein . \ne) Correction of Work.  The performance of services by the Contractor shall \nnot relieve the Contractor from any obligation to correct any incomplete, inaccurate or defective work at no further cost to the SRMT, when such \ninaccuracies are due to the negligence of the Contractor, provided such work has not been accepted in writing by an authorized representative of the SRMT.  \n \n6. DISPUT E RESOLUTIO N. \na) Dispute.  The Contractor  and the SRMT shall settle all disputes arising \nunder this contract by negotiation.  If informal efforts are unsuccessful, the party asserting non -compliance shall serve written notice on the other party. \nThe notice shall iden tify the specific provisions alleged to have been violated \nand a factual basis for the alleged non -compliance.  If the dispute is not \nresolved to the satisfaction of the parties within sixty (60) days after service of the notice set forth above, the partie s could agree to pursue mediation, with \neach party paying its own costs and attorney’s fees and half of all mediation \ncost.  Notwithstanding the foregoing, the Contractor  shall proceed diligently \nwith the performance of this contract, and in accordance wit h the SRMT’s \ndecision, pending final decision of a dispute hereunder . \nb) Waiver of Breach:  Waiver of any breach of any provision of this Contract \nshall not be deemed to be a waiver of any subsequent breach, and shall not be \nconstrued to be a modification of the terms and conditions of this Contract.  \nc) Warrants: The Contractor  warrants that they are competent to perform the \nwork required under the contract in that the Contractor  has the necessary \nqualifications, including the knowledge, skill and ability, to perform the work.  \nAlso, the Contractor  warrants that the Contractor  shall provide a quality of \nservice at least equal to that which Contractor s generally would expect of a \ncompetent Contractor  in a like situation.  \n \n7. MISCELLANEOUS PROVISIONS.  \na) Assignment:  The contract shall not be assigned, in whole or in part, by the \nContractor without the prior written consent of the SRMT.  Any purported \nassignment made without that consent is void and of no effect.   No assignment \nof the Contract shall relieve the Contractor from any obligation under the \nContract or impose any liability upon the SR MT unless otherwise agreed to in \nwriting by the SRMT.  \nb) Successors and Assigns: The Contract shall enure  to the benefit of, and \nshall be binding upon, the successors and permitted assignees of the SRMT \nand of the Contractor . c) Benefit: No Tribal employee of the SRMT shall be admitted to any share or \npart of this contract or to any benefit to arise therefrom , without the written \nconsent of the Tribal Chiefs.  \nd) Non-Exclusivity : This Agreement is considered a non -exclusive Agreement \nbetween the parties. SRMT shall have the right to purchase the same kind of \nservices to be provided by Contractor  hereunder from other sources during the \nterm of this Contract . \ne) Sovereign Immunity: By entering this Agreement, the SRMT does not \nwaive its sovereign immunity and nothing contained herein shall be construed \nas waiving the sovereign immunity of the SRMT.   \nf) Time of the Essence:  It is essential that the Work be performed within or at \nthe time stated in the Agreement.   \ng) Warranty:   Workmanship shall be warranted for a period of twelve (12) \nmonths.  All materials, equipment, etc., shall be warranted for a period of twelve (12) months or warranted by manufacturer’s warranty, whichever is greater.  \n \n8. MANDATORY PROVISIONS FOR PROJECTS  PARTIALLY FUNDED \nWITH FEDERAL FUNDS.   \na) Rights to Inventions.  Contracts for the performance of experimental, \ndevelopment, or research work shall provide for the rights of the Federal Government and the recipient in any resulting invention in accordance with 37 \nCFR part 401 and any implementing regulations issued .   \nb) Contract Work Hours and Safety Standards Act (40 U.S.C. 327 -333) \n(Where applicable).   Contracts in excess of $2 ,000 for Construction and \n$2,500 for other contracts that involve the employment of mechanics or \nlaborers shall comply with Sections 102 and 107 of the Contract Work Hours \nand Safety Standards Act (40 USC 327 -333), as supplemented by Department \nof Labor regulations (29 CFR part 5).  Under Section 102 of the Act, each contrac tor shall be required to compute the wages of every mechanic and \nlaborer on the basis of a standard work week of 40 hours.  Work in excess of the standard work week is permissible provided that the worker is compensated at the rate of not less than 1 -1/2 times the basic rate of pay for all hours worked \nin excess of 40 hours in the work week.  Section 107 of the Act is applicable to \nconstruction work and provides that no laborer or mechanic shall be required to \nwork in surroundings or under working condition s which are unsanitary, \nhazardous or dangerous.  These requirements do not apply to the purchases of supplies or materials or articles ordinarily available on the open market, or contracts for transportation or transmission of intelligence.  \nc) Drug Free Wo rkplace, Debarment and Suspension, Lobbying and \nExecutive Order 11246.  During the performance of this contract, the \ncontractor hereby certifies to abide by all the requirements of Drug Free Workplace Act (1988) under US Code: Title 41, Chapter 10, Debarmen t and \nSuspension under Executive Order 12549, Certification Regarding Lobbying under Section 1352, Title 31 of the U.S. Code, and all of the provisions of Executive Order 11246, Equal Employment Opportunity, as amended, and shall not discriminate against a ny employee or applicant for employment \nbecause of race, color, religion, sex, or national origin.  However, it shall not be a violation of this clause for the CONTRACTOR to extend a publicly \nannounced preference in employment to Indians living on or near an Indian \nreservation, in connection with employment opportunities on or near an Indian reservation, as permitted by 41 CFR 60 -1.5. The Contractor shall include the \nprovision of this subsection in every subcontract under this contract, so as to be \nbinding upon every subcontractor of the Contractor under this Contract.  \nd) Equal Employment Opportunity . The Contractor agrees to conform to all \nof the provisions of E.O. 11246, as amended, and shall not discriminate against \nany employee or applicant for employment because of race, color, religion, sex \nor national origin. However, it shall not be a violation  of this clause for the \nContractor to extend a publicly announced preference in employment to Indians living on or near an Indian reservation, in connection with employment \nopportunities on or near an Indian reservation, as permitted by 41 CFR 60 -1.5. \ne)  Equal Opportunity for Workers with Disabilities:  \n(i) Equal opportunity clause.  The Contractor shall abide by the requirements \nof the equal opportunity clause at 41 CFR 60 -741.5(a)\n, as of March 24, \n2014. This clause prohibits discrimination against qualified individuals  on \nthe basis of disability, and requires affirmative action by the Contractor to \nemploy and advance in employment qualified individuals  with disabilities.  \n(ii) Subcontracts. The Co ntractor shall include the terms of this clause in \nevery subcontract  or purchase order in excess of $15,000 unless exempted \nby rules, regulations, or orders of the Secretary, so that such provisions will \nbe binding upon each subcontractor  or vendor. The Contractor shall act as \nspecif ied by the Director, Office of Federal Contract Compliance Programs \nof the U.S. Department of Labor, to enforce the terms, including action for \nnoncompliance . Such necessary changes  in language may be made  as shall \nbe appropriate to identify properly the parties and their undertakings.  \nSRMT GENERAL CONTRACT TERMS AND CONDITIONS  \n \nPage 3 of 3  V6, October 2023 f) Minority and Women -Owned Business Enterprises (MWBE): The \nContractor agrees to make every good faith effort to promote and assist the \nparticipation of certified Minority and women -owned Business enterprises \n(MWBEs) as subcontractors and suppliers on this c ontract for the provision \nof services and materials. \ng) Equal Opportunity for Veterans (Oct 2015):  \n(i) Definitions. As used in this clause –   \n“Active duty wartime or campaign badge veteran,” “Armed Forces service medal veteran,” “disabled veteran,” “protected veteran,” “qualified disabled \nveteran,” and “recently separated veteran” have the meanings give at FAR \n22.1301.  \n(ii) Equal opportunity clause. The Contractor shall abide by the \nrequirements of the equal opportunity clause at 41 CFR 50 -300.5(a), as of \nMarch 24, 2014.  This clause prohibits discrimination against qualified \nprotected veterans, and requires affirmative action by the Contractor to \nemploy and advance in emplo0yment qualified protected veterans.  \n(iii) Subcontracts.  The Contractor shall inser t the terms of this clause in \nsubcontracts of $150,000 or more unless exempted by rules, regulations, or orders of the Secretary of Labor. The Contractor shall act as specified by the \nDirector, Office of Federal Contract Compliance Programs, to enforce the  \nterms, including action for noncompliance. Such necessary changes in \nlanguage may be made as shall be appropriate to identify properly the \nparties and their undertakings.  \nh) Deficit Reduction Act (“DRA”).  For federal DRA compliance all \ncontractors, agent s, vendors and employees of those entities who furnish or \notherwise authorize the furnishing of Medicaid health care items or services, or those involved in monitoring of health care provided by SRMT, must \ncomply with SRMT’s Corporate Compliance Plan which  can be found at \nhttps://dvc479a3doke3.cloudfront.net/_uploads/environment/FCAContracto\nrVendorAgent -Letter1_2022.pdf .  This “DRA” clause should be included in \nall Contractor’s sub -contracts.  \ni) CFR Appendix II to Part 200, as applicable .  The Contractor represents, \nwarrants and agrees to comply with all Federal requirements as applicable:  Rights to Inventions (37 CFR Part 401); Contract Wo rk Hours and Safety \nStandards Act (40 U.S.C. 327 -333) (where applicable); Copeland Anti -\nKickback Act (18 USC § 874), as supplemented in Department of Labor Regulations (29 CFR Part 3); Clean Air Act (42 USC §7401 -7461q.) and the \nFederal Water Pollution Con trol Act (33 USC §251 -1387) (as amended); \nCFR 200.322 Domestic Preference for Procurements; and CFR Appendix II \nto Part 200, as applicable . \n \n9. PROTECTION OF PERSONS AND PROPERTY \na) Safety and Protection of Work, Property and Persons.  Contractor will \nbe responsible for initiating, maintaining and supervising all safety precautions \nand programs in connection with the Work .  Contractor will take all necessary \nprecautions for the safety of and will provide the necessary protection to \nprevent damage, injury or loss to all employees at the work site and all other persons who may be affected thereby. Contractor shall conform to the SRMT’s  \nRespiratory Virus Workplace  Safety Policy  and Contractor’s Safety Policy, \nand this shall be made a conditi on of each subcontract entered into pursuant to \nthe contract. \nb) Protection of Existing Vegetation, Structures, Equipment, Utilities, and \nImprovements .  The Contractor shall preserve and protect all structures, \nequipment, and vegetation (such as trees, shrubs, and grass) on or adjacent to the \nwork sites, which are not to be removed and which do not unreasonably interfere \nwith the work required under this Contract. The Contractor shall remove trees \nonly when specifically authorized to do so, and shall avo id damaging vegetation \nthat will remain in place.  If any limbs or branches of trees are broken during \nContract performance, or by the careless operation of equipment, or by \nworkmen, the Contractor shall trim those limbs or branches with a clean cut and \npaint the cut with a tree -pruning compound as directed by the Environment \nDivision representative.   The Contractor shall protect, from damage, all existing \nimprovements and utilities (1) at or near the work site and  (2) on adjacent \nproperty of a third party,  the locations of which are made known to or should be \nknown by the Contractor. The Contractor shall repair any damage to those \nfacilities, including those that are the property of a third party, resulting from \nfailure to comply with the requirements of th is Contract or failure to exercise \nreasonable care in performing the work. If the Contractor fails or refuses to \nrepair the damage promptly, the SRMT may have the necessary work performed \nand charge the cost to the Contractor.  \nc) Accident Prevention and Sa fety Program.  The Contractor shall be solely \nand completely responsible for conditions of the job site, including safety of all persons, employees, and property during performance of the work. This \nrequirement shall apply continuously and not be limited t o normal working \nhours. Safety provisions shall conform to U.S. Department of Labor (OSHA), \nand all other applicable Federal, State, County, and local laws, if applicable \nTribal laws, ordinances, codes, the requirements set forth, and any regulations \nthat may be detailed in other parts of this Contract.  Where any of these are in conflict, the more stringent requirement shall be followed. The Contractor's \nfailure to thoroughly familiarize themselves with the aforementioned safety \nprovisions shall not reliev e them from compliance with the obligations and \npenalties set forth herein.   \ne) Replacement of Personnel  \n1)  When specific persons have been named in the Agreement as the persons \nwho must perform the Work, the Contractor shall provide the services of \nthe persons so named unless the Consultant/Contractor is unable to do so \nfor reasons beyond its control.  \n2) If at any time the Consultant/Contractor is unable to provide the services of any specific person named in the Contract, it shall provide a \nreplacement person with similar qualifications and experience.  \n3) The Consultant/Contractor shall, at least thirty (30) days, where possible, \nin advance of the date upon which a replacement person is to commence \nwork, provide notice in writing to the SRMT containing:  i) the reason for \nthe removal of the named person from the Work;  and ii) the name, \nqualifications and experience of the proposed replacement person; and  \n4) The SRMT shall have fifteen (15) calendar days after receipt of the notice to the SRMT to review the  proposed replacement person for \npurposes of acceptance.  If the Consultant/Contractor is not notified \nwithin this 15 -day period, the proposal shall be considered as having \nbeen accepted. \n5) In no event shall the Consultant/Contractor allow performance of the \nWork by unauthorized replacement persons and acceptance of a replacement person by the SRMT shall not relieve the \nConsultant/Contractor from responsibility to meet the requirements of the \nEngagement Letter . \n6) The SRMT may order the removal from the Wo rk of any such \nreplacement person and the Consultant/Contractor shall immediately \nremove the person from the Work and shall, in accordance with the above \nsubsections secure a further replacement. \n7) The fact that the SRMT does not order the removal of a re placement person \nfrom the Work shall not relieve the Consultant/Contractor from its \nresponsibility to meet the requirements of the Agreement.  \n "
}